In [24]:
import pandas as pd
import numpy as np
import hvplot.pandas

In [51]:
df = pd.read_csv('./data/names_df.csv')
df.head()

            Name Sex   Number   Year
0       --Mary--   F  L007065  Y1880
1       --Anna--   F  L002604  Y1880
2       --Emma--   F  L002003  Y1880
3  --Elizabeth--   F  L001939  Y1880
4     --Minnie--   F  L001746  Y1880

In [52]:
df['Name'] = df.Name.str.strip('--')
df['Number'] = df.Number.str.strip('L00').astype(np.int)
df['Year'] = df.Year.str.strip('Y').astype(np.int)
# 'Female' == 0, 'Male' == 1
#df['Sex'] = df.Sex.apply(lambda x: 0 if x=='F' else 1)

In [53]:
df.groupby(['Year', 'Sex']).count().head()

          Name  Number
Year Sex
88   F       1       1
1880 F     942     942
     M    1058    1058
1881 F     938     938
     M     997     997

In [56]:
df[df.Year == 88]

       Name Sex  Number  Year
17502  Mary   F   11754    88

In [55]:
idx = df[df.Year == 88].index[0]
df.at[idx-1, 'Year'], df.at[idx+1, 'Year']

(1887, 1888)

In [62]:
samp = df[df.Year == 1888]
samp[samp.Name == 'Mary']

       Name Sex  Number  Year
19223  Mary   M       5  1888

In [63]:
df.at[idx, 'Year'] = 1888

In [95]:
grouped = df.groupby(['Sex', 'Year']).count()
grouped.head()

          Name  Number
Sex Year
F   1880   942     942
    1881   938     938
    1882  1028    1028
    1883  1054    1054
    1884  1172    1172

In [77]:
df.groupby(['Year', 'Sex']).count().head()

          Name  Number
Year Sex
1880 F     942     942
     M    1058    1058
1881 F     938     938
     M     997     997
1882 F    1028    1028

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1924665 entries, 0 to 1924664
Data columns (total 4 columns):
Name      object
Sex       object
Number    int64
Year      int64
dtypes: int64(2), object(2)
memory usage: 58.7+ MB

In [101]:
df.head()

        Name Sex  Number  Year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

### Most common names
1.	What was the most common male name in 1989?

In [110]:
df[(df.Year == 1889) & (df.Sex == 'M')].iloc[0, :].Name

'John'

2.	What was the most common female name in 1989?

In [113]:
df[(df.Year == 1889) & (df.Sex == 'F')].iloc[0, :].Name

'Mary'

3.	Write code to output a list of the most common male names by year.

In [126]:
def most_common_male_names(year, n=10):
    s = df[(df.Year == int(year)) & (df.Sex == 'M')].Name[:n]
    return list(s)

In [128]:
most_common_male_names(1990, 15)

['Michael',
 'Christopher',
 'Matthew',
 'Joshua',
 'Daniel',
 'David',
 'Andrew',
 'James',
 'Justin',
 'Joseph',
 'Ryan',
 'John',
 'Robert',
 'Nicholas',
 'Anthony']

4.	Write code to output a list of the most common female names by year.

In [129]:
def most_common_female_names(year, n=10):
    s = df[(df.Year == int(year)) & (df.Sex == 'F')].Name[:n]
    return list(s)

In [132]:
most_common_female_names(1994)

['Jessica',
 'Ashley',
 'Emily',
 'Samantha',
 'Sarah',
 'Taylor',
 'Brittany',
 'Amanda',
 'Elizabeth',
 'Megan']

### Name diversity
5.	How many unique names are there in the entire dataset?

In [134]:
df.Name.nunique()

97311

6.	How many unique male names were there in 1989?

In [138]:
df[(df.Year == 1989) & (df.Sex == 'M')].Name.nunique()

9227

7.	How many unique female names were there in 1989?

In [139]:
df[(df.Year == 1989) & (df.Sex == 'F')].Name.nunique()

14546

8.	How many unique names (male and female) were there in 1989?

In [142]:
df[(df.Year == 1989)].Name.nunique()

21621

9.	Why is the number of unique names in 1989 (problem #8) smaller than the sum of unique male names (problem #6) and unique female names (problem #7) for that year?

In [149]:
ans6 = df[(df.Year == 1989) & (df.Sex == 'M')].Name.nunique() 
ans7 = df[(df.Year == 1989) & (df.Sex == 'F')].Name.nunique()
ans8 = df[(df.Year == 1989)].Name.nunique()
print('Unique Names - M+F: ', (ans6 + ans7), '\n' + 'Unique Names - All: ', ans8)

Unique Names - M+F:  23773
Unique Names - All:  21621

In [150]:
M89 = df[(df.Year == 1989) & (df.Sex == 'M')].Name
F89 = df[(df.Year == 1989) & (df.Sex == 'F')].Name
T89 = df[(df.Year == 1989)].Name

In [155]:
len(set(M89) | set(F89))

21621

Some Males and Females born in 1989 share the same names.

10.	Write code to output a list of names that show up in both the male and female groups in 1989. How many names show up in both groups for that year?

11.	Show how the answer to problem #10 helps explain the answer to problem #9.

### Unisex names
12.	Provide a list of the most common unisex names through 2017. Describe and justify your criteria for a name to be considered unisex. What other criteria could you use for a name to be unisex?

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1924665 entries, 0 to 1924664
Data columns (total 4 columns):
Name      object
Sex       object
Number    object
Year      object
dtypes: object(4)
memory usage: 58.7+ MB

In [15]:
import dask.dataframe as dd

df = dd.read_csv('./data/names_df.csv')

In [17]:
df.info()

<class 'dask.dataframe.core.DataFrame'>
Columns: 4 entries, Name to Year
dtypes: object(4)

## Machine learning exercise

Design and create a machine learning model that classifies a name as either male or female based on the characteristics of the name. Write up a report with screenshots in a text document or Jupyter notebook that describes the following:

•	the input data and its quality

•	any data exploration and any interesting insights

•	any preprocessing or cleaning of the data that was needed, including how you chose to label the data (i.e., how you labeled a name male or female as the ground truth for the model)

•	the features used by your model and why you chose them

•	your selection of machine learning algorithm and why it was chosen

•	the accuracy of your model and any relevant metrics that describe model performance

•	any model parameter tuning used to improve performance

•	any relevant discussion, model interpretation, future steps, or further exploration needed

In addition, prepare a short slideshow presentation (~10 min.) of an overview of the machine learning exercise. You will present this to the analytics team.
There are no restrictions on the classification model that you use; however, be sure to keep in mind your ability to adequately explain and interpret the results.
Good luck!